# FilterStringLess Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterStringLess Class
Members See Also
---
Tests whether string values from the document would sort before a certain string.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class FilterStringLess : FilterStringRuleEvaluator
```

Visual Basic
---
```text
Public Class FilterStringLess _
	Inherits FilterStringRuleEvaluator
```

Visual C++
---
```text
public ref class FilterStringLess : public FilterStringRuleEvaluator
```

# Remarks
All string comparisons in this class are performed in the case-insensitive manner.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FilterStringRuleEvaluator Autodesk.Revit.DB..::..FilterStringLess
# See Also
FilterStringLess Members
Autodesk.Revit.DB Namespace